Tekla.Structures.Drawing.ReferenceModel.ReferenceModelAttributes
The ReferenceModelAttributes class contains attributes for reference model objects.
Tekla.Structures.Drawing.ReferenceModel

Tekla.Structures.Drawing.ReferenceModel.ReferenceModelAttributes.Line
Gets or sets the line type.
Tekla.Structures.Drawing.LineTypeAttributes

Tekla.Structures.Drawing.ReferenceModel.ReferenceModelAttributes.LineType
Deprecated, use Line instead

Tekla.Structures.Drawing.ReferenceModel.ReferenceModelAttributes.Color
Deprecated, use Line instead

Tekla.Structures.Drawing.ReferenceModel.ReferenceModelAttributes.#ctor(System.Boolean)
Initializes a new instance of reference model attributes class that may load standard attributes.

Tekla.Structures.Drawing.ReferenceModel.ReferenceModelAttributes.#ctor
Creates a new default reference model attributes instance that loads standard attributes.

Tekla.Structures.Drawing.ReferenceModel.ReferenceModelAttributes.LoadAttributes(System.String)
Loads the specified attribute file.
AttributeFile: The name of the attribute file.
Returns: True if succeeded.

Tekla.Structures.Drawing.ReferenceModel.ReferenceModelAttributes.IsEqual(System.Object)
Compares the current object with an object of the same type.
ObjectToCompare: The object to be used for comparing.
Returns: True if all the fields (except for the database GUID) of the objects match.